import Image from 'next/image'
import React from 'react'

export default function Description() {
    return (

        <div className='flex justify-center lg:mt-[163px] lg:mb-[96px] md:mt-[100px] md:mb-[66px] mt-[71px] mb-[55px]  '>
            <div className="container justify-center lg:w-[1140px] md:w-[731px] w-[335px]">
                <div className='flex flex-col items-center '>
                    <div >
                        <h2 className='lg:mb-[41px] md:text-[24px] md:mb-[25px] text-[20px] mb-[19px]  '>توضیحات کلی در مورد رمز ارزها</h2>
                        <p className='lg:text-[14px] lg:leading-[32px]  md:text-[12px] md:leading-[28px] text-[10px] leading-[24px] text-justify'>رمز ارز ها از پروتکل های رمزگرافیکی و یا کد های فوق العاده پیچیده برای رمز گذاری دیتاهای حساس و انتقال آن ها استفاده می کنند تا معاملات امنی را فراهم کنند. توسعه دهندگان رمز ارزها این پروتکل ها را بر پایه اصول پیچیده ریاضیات و مهندسی کامپیوتر بنا کرده اند که آن ها را غیرقابل نفوذ می کند. این پروتکل ها همچنین هویت افراد استفاده کننده از رمز ارز ها را مخفی نگه می دارد و ردیابی و پیدا کردن آن ها را برای هر کسی و هر دولتی دشوار می کند. رمز ارزها همچنین برای کنترل شدن غیر متمرکز خود شناخته می شوند. این به آن معناست که تمام فعالیت ها و ارزش های این بازار توسط همان کد های پیچیده کنترل و ارزیابی می شوند و بانک ها و یا مقامات دولت ها کنترلی روی آن ها ندارند. ارزهای دیجیتال امکان معامله شدن توسط ارزهای واقعی را نیز دارا می باشند و شما می توانید در بعضی از مارکت های خاص و صرافی های شناخته شده، مانند بایننس (Binance)، ارز های دیجیتال خود را با دلار، پوند، یورو و غیره جایگزین کنید. خطر اصلی در همین مرحله اتفاق می افتد جایی که هکر ها و بدافزار ها امکان بلوکه کردن پول شما را در حین این انتقال دارا هستند.</p>
                    </div>
                    <div className='lg:w-[750px] lg:h-[422] lg:my-[66px] md:w-[731px] md:h-[411] md:my-[53px] w-[335px] h-[325px] relative  sm:w-full max-w-[750px] '>
                        <Image
                            className=' object-contain'
                            src="/images/Group 806.png"
                            alt="Example"
                            fill
                            sizes="(max-width: 768px) 100vw, 750px"
                        />
                    </div>
                    <div>
                        <p className='lg:leading-[32px] lg:text-[14px] md:text-[12px] md:leading-[28px] text-[10px] leading-[24px]  text-justify '>رمز ارز ها از پروتکل های رمزگرافیکی و یا کد های فوق العاده پیچیده برای رمز گذاری دیتاهای حساس و انتقال آن ها استفاده می کنند تا معاملات امنی را فراهم کنند. توسعه دهندگان رمز ارزها این پروتکل ها را بر پایه اصول پیچیده ریاضیات و مهندسی کامپیوتر بنا کرده اند که آن ها را غیرقابل نفوذ می کند. این پروتکل ها همچنین هویت افراد استفاده کننده از رمز ارز ها را مخفی نگه می دارد و ردیابی و پیدا کردن آن ها را برای هر کسی و هر دولتی دشوار می کند. رمز ارزها همچنین برای کنترل شدن غیر متمرکز خود شناخته می شوند. این به آن معناست که تمام فعالیت ها و ارزش های این بازار توسط همان کد های پیچیده کنترل و ارزیابی می شوند و بانک ها و یا مقامات دولت ها کنترلی روی آن ها ندارند. ارزهای دیجیتال امکان معامله شدن توسط ارزهای واقعی را نیز دارا می باشند و شما می توانید در بعضی از مارکت های خاص و صرافی های شناخته شده، مانند بایننس (Binance)، ارز های دیجیتال خود را با دلار، پوند، یورو و غیره جایگزین کنید. خطر اصلی در همین مرحله اتفاق می افتد جایی که هکر ها و بدافزار ها امکان بلوکه کردن پول شما را در حین این انتقال دارا هستند.</p>
                    </div>

                </div>
            </div>

        </div>
    )
}
